/*
    基本字元集合的字元，以及其顯示結果
*/

#include  <stdio.h>

int main(void) {
    int   i;
    char  cset[] = {
        'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
        'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
        'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
        'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
        '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',
        '!', '"', '#', '%', '&', '\'', '(', ')', '*', '+', ',', '-', '.',
        '/', ':', ';', '<', '=', '>', '?', '[', ']', '^', '_', '{', '|',
        '}', '~'
    };

    for (i = 0; i < sizeof(cset); i += 2)       /*兩個兩個顯示*/
        printf("'%c' = %02X   '%c' = %02X\n",
               cset[i], cset[i], cset[i + 1], cset[i + 1]);

    printf("' ' = %02X   '\\a' = %02X\n",  ' ',  '\a');
    printf("'\\b' = %02X  '\\f' = %02X\n", '\b', '\f');
    printf("'\\n' = %02X  '\\r' = %02X\n", '\n', '\r');
    printf("'\\t' = %02X  '\\v' = %02X\n", '\t', '\v');

    system("PAUSE");
    return (0);
}
